export const NAMES = {
  botName: 'GPT-bot-learn',
  api: 'GPT-bot-learn-api',
  DBname: 'GPT_Bot_Users',
  wortDB: 'Dictionary-learn',
};

export const TEXT = {
  NO_ACCESS: 'У вас не має доступу, почекайте поки вам нададуть доступ',
  NO_ACCESS_ACTION: 'У вас не має доступу для виконання ціеї операції',
  NO_ACCESS_ADD: 'Лише адміністратор може додавати користувачів',
  SUCCESSFUL_ADD: 'Тепер ви можете користуватися чатом',
  ERROR: 'Виникла помилка',
  SYSTEM_QUERY: 'Ти допомагаєш мені вивчити Німецьку мову',
  QUERY: `Надай значення цього слова  німецькою мовою, а також українською. Якщо це дієслово - напиши його в формі інфінітиву
	 та його форму Partizip II, а також зворотнє чи не зворотнє це дієслово.
	Дай 5 прикладів його вживання в реченнях німецькою мовою з перекладом на українську.
	Напиши тлумачення цього слова німецькою мовою рівнем зрозумілим для B1.
	При можливості надай синоніми та антоніми до цього слова.
	Якщо з цього слова можна утворити нові (іменник, прикметник, дієслово, пріслівник) - то напиши іх 
	та дай коротке пояснення українською мовою`,
  QUERY_SATZ: `Надай переклад речення та поясни кожне слово. Поясни грамматику в цьому реченні.
	Де в цьому реченні об'єкт, де суб'єкт. Поясни с якій формі використовуються слова 
	(Akkusativ, Dativ, Nominativ, Genitiv).	Якщо можливо - надай свій граматично вірний варіант.`,
  TRANSLATE_QUERY:
    'Переклади на німецьку мову та надай коротке пояснення чому так перекладається',
  WRONG_LANG_QUERY: `Помилка запиту підтримуються такі: 'de', 'uk', 'ru'.
	Приклад встановлення мови введіть '/lang uk'`,
  IMAGE_QUERY: `Опиши в 10 реченнях на німецькій мові картинку, опис надай рівнем мови B1, на надай переклад опису українською`,
  INFO: `Це бот для допомоги вивчення Німецької мови.
	Введіть слово або речення німецькою мовою і отримаєте пояснення.
'/list' - Показує список користувачів;
'/пер' - Перекладає слово або речення на німецьку мову;
'/запит' - Працює як звичайний чат GPT;
'/lang' - Встановлює мову транскрипції, доступні такі мови: 'de', 'uk', 'ru'. Для транскрипції просто відправте голосове повідомлення;
'/save' - зберегти слово;
'/getlist' - отримати список збережених слів`,
};
